Cats99/app/controllers/cats_controller.rb

    def show
        @kat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @kat = Cat.new(cat_params)
        if @kat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def edit
        @kat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def update
        @kat = Cat.find_by(id: params[:id])

        if @kat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "birth_date" = $2, "color" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["description", "Not so bad!"], ["birth_date", "2021-06-10"], ["color", "Black"], ["updated_at", "2022-07-01 20:31:28.508455"], ["id", 3]]